## import libraries

In [35]:
import pandas as pd
import sqlite3

### connect to database

In [14]:
conn = sqlite3.connect("students.sqlite")

### read database

In [16]:
pd.read_sql('select * from students',con=conn)

  first_name last_name country   age             topic  grade
0    Mustafa    Othman     EGY  34.0      Data Science   17.5
1      Omnia  Abdullah     KSA  28.0     Data Analysis   20.0
2     Siddik    Burhan     ESP  45.0     Data Analysis   19.0
3      Ahmed    Radwan     PSE  32.0  Data Engineering  14.25
4     Mariam     Mazen     EGY  18.0      Data Science   20.0
5    Mustafa     Jalil     MAR  36.0     Data Analysis   12.5

### provide query showing first_name

In [19]:
pd.read_sql("select count(first_name) from students",con=conn)

   count(first_name)
0                  6

### show first_names which started with M

In [20]:
pd.read_sql("select * from students where first_name like 'M%' ",con=conn)

  first_name last_name country   age          topic grade
0    Mustafa    Othman     EGY  34.0   Data Science  17.5
1     Mariam     Mazen     EGY  18.0   Data Science  20.0
2    Mustafa     Jalil     MAR  36.0  Data Analysis  12.5

### provide all topic which belong to data analysis

In [21]:
pd.read_sql("select * from students where topic = 'Data Analysis' ",con=conn)

  first_name last_name country   age          topic grade
0      Omnia  Abdullah     KSA  28.0  Data Analysis  20.0
1     Siddik    Burhan     ESP  45.0  Data Analysis  19.0
2    Mustafa     Jalil     MAR  36.0  Data Analysis  12.5

### show ages between 18 and 30

In [25]:
pd.read_sql("select * from students where age between '18' and '30'",con=conn)

  first_name last_name country   age          topic grade
0      Omnia  Abdullah     KSA  28.0  Data Analysis  20.0
1     Mariam     Mazen     EGY  18.0   Data Science  20.0

### provide sum of all grade

In [26]:
pd.read_sql("select sum(grade) from students",con=conn)

   sum(grade)
0      103.25

### select all from EGY

In [27]:
pd.read_sql("select * from students where country = 'EGY'",con=conn)

  first_name last_name country   age         topic grade
0    Mustafa    Othman     EGY  34.0  Data Science  17.5
1     Mariam     Mazen     EGY  18.0  Data Science  20.0

### select all not in EGY

In [28]:
pd.read_sql("select * from students where not country = 'EGY'",con=conn)

  first_name last_name country   age             topic  grade
0      Omnia  Abdullah     KSA  28.0     Data Analysis   20.0
1     Siddik    Burhan     ESP  45.0     Data Analysis   19.0
2      Ahmed    Radwan     PSE  32.0  Data Engineering  14.25
3    Mustafa     Jalil     MAR  36.0     Data Analysis   12.5

### select mean of age

In [29]:
pd.read_sql("select avg(age) from students",con=conn)

    avg(age)
0  32.166667

### select all and order it by age descending

In [30]:
pd.read_sql("select * from students order by age desc",con=conn)

  first_name last_name country   age             topic  grade
0     Siddik    Burhan     ESP  45.0     Data Analysis   19.0
1    Mustafa     Jalil     MAR  36.0     Data Analysis   12.5
2    Mustafa    Othman     EGY  34.0      Data Science   17.5
3      Ahmed    Radwan     PSE  32.0  Data Engineering  14.25
4      Omnia  Abdullah     KSA  28.0     Data Analysis   20.0
5     Mariam     Mazen     EGY  18.0      Data Science   20.0

### generate column called full_name which concate first_name with last_name

In [32]:
pd.read_sql("SELECT first_name,last_name,first_name||' '|| last_name as full_name from students",con=conn)

  first_name last_name       full_name
0    Mustafa    Othman  Mustafa Othman
1      Omnia  Abdullah  Omnia Abdullah
2     Siddik    Burhan   Siddik Burhan
3      Ahmed    Radwan    Ahmed Radwan
4     Mariam     Mazen    Mariam Mazen
5    Mustafa     Jalil   Mustafa Jalil

### show count of data science topic

In [34]:
pd.read_sql("SELECT count(topic) from students where topic == 'Data Science'",con=conn)

   count(topic)
0             2